# GetLoops Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCExtrusionData..::..GetLoops Method
IFCExtrusionData Class See Also
---
Gets the curve loops that form the base shape of the extrusion.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public IList<CurveLoop> GetLoops()
```

Visual Basic
---
```text
Public Function GetLoops As IList(Of CurveLoop)
```

Visual C++
---
```text
public:
IList<CurveLoop^>^ GetLoops()
```

# ### Return Value
The collection of loops.
# See Also
IFCExtrusionData Class
Autodesk.Revit.DB.IFC Namespace